In [40]:
import pandas as pd
import numpy as np

In [41]:
data = [1, 2, 3, 4 ,5]
series = pd.Series(data)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [42]:
dara = {'a':1, 'b': 2, 'c': 3, 'd':4}

series_dict = pd.Series(dara)
print(series_dict)

a    1
b    2
c    3
d    4
dtype: int64

In [43]:
idx = ['a', 'b', 'c', 'd', 'e']
series = pd.Series(data, index=idx)

In [44]:
series

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [45]:
data = {
    'Name': ['ankush', 'punja', 'kushal', 'het'],
    'City': ['surat', 'porbandar','rajkot','ahmedabad'],
    'age': [19, 19, 18, 18]
}

In [46]:
df = pd.DataFrame(data)
print(df)
print(type(df))

     Name       City  age
0  ankush      surat   19
1   punja  porbandar   19
2  kushal     rajkot   18
3     het  ahmedabad   18
<class 'pandas.core.frame.DataFrame'>

In [47]:
df

     Name       City  age
0  ankush      surat   19
1   punja  porbandar   19
2  kushal     rajkot   18
3     het  ahmedabad   18

In [48]:
df['Name'] #it becomes a series automatically when we access a single row

0    ankush
1     punja
2    kushal
3       het
Name: Name, dtype: object

In [49]:
print(type(df['Name']))

<class 'pandas.core.series.Series'>

In [50]:
df.loc[1]

Name        punja
City    porbandar
age            19
Name: 1, dtype: object

In [51]:
df.iloc[1][0]

'punja'

In [52]:
df.at[1,'City']

'porbandar'

In [53]:
#adding a column
df['mobiles'] = ['itel', 'apple', 'oneplus', 'realme']

#delete a column
# df.drop('salary', axis=1, inplace=true)

In [54]:
df

     Name       City  age  mobiles
0  ankush      surat   19     itel
1   punja  porbandar   19    apple
2  kushal     rajkot   18  oneplus
3     het  ahmedabad   18   realme

In [55]:
#updating
df['age']= df['age']+1
df

     Name       City  age  mobiles
0  ankush      surat   20     itel
1   punja  porbandar   20    apple
2  kushal     rajkot   19  oneplus
3     het  ahmedabad   19   realme